# 1. Дано витрати машиною пального на 100 км, ціну 1 л пального,
#  а також шлях, який потрібно проїхати водію. Обчислити та
#   вивести на екран скільки потрібно витратити грошей водію,
#    щоб проїхати вказаний шлях

# expense = int(input('enter the expense'))
# price = int(input('enter price'))
# distance =int(input('enter distance'))
# sum1 = expense*price*distance/100
# print(sum,'uan')


# 2. Користувач вказує ціну однієї хвилини вихідного дзвінка
#  з одного мобільного оператора іншому, а також тривалість розмови.
#   Необхідно обрахувати грошову сумму, на яку був здійснений дзвінок

# cinaMinute = int(input('enter the price of one minute '))
# minutes = int(input('enter number of minutes '))
# sum2 = cinaMinute*minutes
# print('amount per call', sum2)


# 3. Написати програму, яка переводить повний оберт планети Марс
# навколо Сонця в земні роки. Оберти ввести з клавіатури.
# (Марс робить повний оберт навколо Сонця за 686 земних днів)

# revolutions = int(input("number of revolutions"))
# year = revolutions*686/365
# print('number of earth years =>', year)


# 4. Розробити програму, що переводить значення температури
# в градусах по Цельсію в температуру по Фаренгейту та навпаки.
# Співвідношення між температурами визначається формулою:
# TF = TC * 1.8 + 32. Діалог с користувачем реалізувати через систему меню.

# temperature = int(input('Введіть температуру => '))

# degree = int(input('В яку систему вимірювання переводимо \n1.Градуси по Целисію \n2. По Фарангейту\n'))
# if degree == 1:
#     tc = (temperature - 32)/1.8
#     print(tc,' градусів Цельсія')
# elif degree == 2:
#     tc = temperature*1.8 + 32
#     print(tc,' температура по Фарангейту')


# 5. Написати повноцінний калькулятор. Введення цифр та вибір
#  математичної операції виконати в діалоговому стилі 
#  (запитати у користувача, вивести меню). У програмі передбачити
#   уникнення помилок (ділення на нуль і т.д.).
#    Фантазія та «дизайн» меню – ціниться та вітається!!!

